In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [12]:
df = pd.read_csv('o25mso/homework/apply_demo.csv')

In [14]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [16]:
df.size

7978

In [17]:
s1 = Series(['a']*7978)

In [18]:
df['A'] = s1

In [21]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [23]:
df['A'] = df['A'].apply(str.upper)

In [24]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [27]:
l1 = df['data'][0].strip().split(' ')

In [28]:
l1

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [29]:
l1[1],l1[3],l1[5]

('APPL', '0', '1623')

In [32]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1],items[3],items[5]])

In [33]:
df_tmp = df['data'].apply(foo)

In [34]:
df_tmp.head()

      0  1     2
0  APPL  0  1623
1  APPL  0  1623
2  APPL  0  1623
3  APPL  0  1623
4  APPL  1  1649

In [40]:
df_tmp = df_tmp.rename(columns = {0:'Symbol',1:'Seqno',2:'Price'})

In [41]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [42]:
df_new =df.combine_first(df_tmp)

In [43]:
df_new

,A,Price,Seqno,Symbol,data,time
0,A,1623.0,0.0,APPL,Symbol: APPL Seqno: 0 Price: 1623,1473411962
1,A,1623.0,0.0,APPL,Symbol: APPL Seqno: 0 Price: 1623,1473411962
2,A,1623.0,0.0,APPL,Symbol: APPL Seqno: 0 Price: 1623,1473411963
3,A,1623.0,0.0,APPL,Symbol: APPL Seqno: 0 Price: 1623,1473411963
4,A,1649.0,1.0,APPL,Symbol: APPL Seqno: 1 Price: 1649,1473411963
...,...,...,...,...,...,...
3984,A,1680.0,998.0,APPL,Symbol: APPL Seqno: 998 Price: 1680,1473412961
3985,A,1509.0,999.0,APPL,Symbol: APPL Seqno: 999 Price: 1509,1473412961
3986,A,1509.0,999.0,APPL,Symbol: APPL Seqno: 999 Price: 1509,1473412961
3987,A,1509.0,999.0,APPL,Symbol: APPL Seqno: 999 Price: 1509,1473412961
3988,A,1509.0,999.0,APPL,Symbol: APPL Seqno: 999 Price: 1509,1473412962

In [44]:
del df_new['data']

In [45]:
df_new

      A   Price  Seqno Symbol        time
0     A  1623.0    0.0   APPL  1473411962
1     A  1623.0    0.0   APPL  1473411962
2     A  1623.0    0.0   APPL  1473411963
3     A  1623.0    0.0   APPL  1473411963
4     A  1649.0    1.0   APPL  1473411963
...  ..     ...    ...    ...         ...
3984  A  1680.0  998.0   APPL  1473412961
3985  A  1509.0  999.0   APPL  1473412961
3986  A  1509.0  999.0   APPL  1473412961
3987  A  1509.0  999.0   APPL  1473412961
3988  A  1509.0  999.0   APPL  1473412962

[3989 rows x 5 columns]

In [46]:
del df_new['A']

In [48]:
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [49]:
df_new.to_csv('o25mso/homework/demo_duplicate.csv')

In [56]:
ls o25mso\homework

 Volume in drive C is OS
 Volume Serial Number is 5ECB-C6A3

 Directory of C:\Users\stell\Desktop\Python Stella\Python3 Basic and Data Analysis\o25mso\homework

11/13/2017  05:09 AM    <DIR>          .
11/13/2017  05:09 AM    <DIR>          ..
11/13/2017  05:09 AM             6,148 .DS_Store
11/13/2017  05:09 AM            42,706 AMZN.csv
11/13/2017  05:09 AM           195,031 apply_demo.csv
11/13/2017  05:09 AM            38,415 BABA.csv
11/13/2017  05:09 AM               423 city_weather.csv
02/12/2020  10:33 PM           138,092 demo_duplicate.csv
11/13/2017  05:09 AM             4,600 iris.csv
11/13/2017  05:09 AM         1,494,688 movie_metadata.csv
11/13/2017  05:09 AM            44,028 Pokemon.csv
11/13/2017  05:09 AM             9,520 sales-funnel.xlsx
11/13/2017  05:09 AM            52,089 top5.csv
11/13/2017  05:09 AM            61,194 train.csv
11/13/2017  05:09 AM        10,578,201 usa_flights.csv
              13 File(s)     12,665,135 bytes
               2 Dir(s)  183,501,643,776 bytes free